package by.htp.luchko;

public class Task07 {

	/*
	 * Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь
	 * прямоугольника.
	 * 
	 */

	public static void main(String[] args) {

		double a = 10;
		double b = a / 2;

		double s = a * b;

		System.out.println("S = " + s);

	}

}
