package by.htp.luchko;

public class Task01 {

	/*
	 * Даны два действительных числа х и у. Вычислить их сумму, разность,
	 * произведение и частное.
	 */

	public static void main(String[] args) {

		double x = 10;
		double y = 7;

		double s = x + y;
		double r = x - y;
		double p = x * y;
		double c = x / y;

		System.out.println("Сумма= " + s);
		System.out.println("Разность = " + r);
		System.out.println("Произведение= " + p);
		System.out.println("Частное = " + c);

	}

}
